package com.cetc.cloud.datasynch.provider.tools;

import junit.framework.TestCase;

import java.util.Arrays;

/**
 * PackageName:   com.cetc.cloud.datasynch.provider.tools
 * projectName:   dataSyncher
 * Description:   luolinjie 补充
 * Creator:     by luolinjie
 * Create_Date: 2018/12/5 10:11
 * Updater:     by luolinjie
 * Update_Date: 2018/12/5
 * Update_Description: luolinjie 补充
 **/
public class DbToolsTest extends TestCase {

    public void testGetDecoratedColumn() throws Exception {
        String value = "标签：点击标签查看相关内容【惧怕权贵、欺负民众】福田区发布的招生地段调整有违“以人民为中心”最高指示、有违教育公平、有违学区划要求恢复香格丽苑小区原深圳市福田区侨香外国语学校（以下简称“侨外”）的学位的强烈诉求我们是福田区侨香四道香格丽苑小区业主，致信来表达要求恢复香格丽苑小区原深圳市福田区侨香外国语学校（以下简称“侨外”）的学位的强烈诉求。香格丽苑小区属于侨香片区！我们强烈反对福田区教育局“权威发布”的“2019年福田区义务教育阶段学位预警及学校生地段调整征求意见”！！！这个调整公告严重违背“以人民为中心”最高指示、违背教育公平、有违学区划分原则！！！其中发布的“红岭教育集团红岭实验小学（在建）”的招生地段划分，严重侵害了属于侨外招生范围的香格丽苑小区适龄儿童们原本应享有的优质义务教育权益，伤害了长居于此地且对深圳贡献税收水平高出平均值以上的居民群体的合理权益！！！我们小区全体业主本着捍卫自身正当合法的享受公平优质教育资源的权益，维护社会稳定的大局出发，前来请愿，表达诉求。诉求1：我们强烈且坚决要求香格丽苑小区（即侨香四道以北、安托山六路以东、侨香路以西区域）的小学学位仍旧划归福田区侨香外国语学校招生范围内！！！诉求2：对重新调整后的学区（香格丽苑重新划归侨外学区）进行必要且充分的公示；诉求3：如侨外的学区较为紧张，建议将侨外目前非学区的学生进行清理。全体业主申诉理由如下：1、此次学区调整严重违背党中央指示，严重违背学区划分的“就近原则”和“以主干道划分原则”，香格丽苑小区原属的福田区侨香外国语学校，位于香蜜湖路以西，这次调整中未将市级重点主干道香蜜湖路作为划分线，未将香蜜湖路另一侧的豪宅小区调整划分出去，反而以一条仅仅几百米的支路“安托山七路”为界，将与侨香村一墙之隔的香格丽苑小区划离学位片区，背后体现的到底是什么划分原则，“畏惧权贵、欺负民众”的原则么？？？香格丽苑小区以南的侨香四道、侨香三道都比安托山七路更长、更宽，更有理由作为主干道来划分，这次调整若是遵循学位划分基本原则，以香蜜湖路以西、以侨香四道以北为划分线，更能体现人民政府、公务员们不惧权贵、也顾全周边居民教育公平的政治素养和高尚品质！2、 此次学区的重新调整没有任何合理理由目前侨外的学区内没有新增楼盘，基本的居住情况没有变化，户数未有增加，2018年一年级新生都在正常的接受全日制教育，学校的硬件软件都到位，为什么在这些情况没有发生改变的情况下，对原有学区内的香格丽苑小区划出原有学区？未来空出来的学位给谁？据我们了解，目前侨外学校还存在很多非学区的学生在此入学，具体名单因为隐私原因我们不在此说明，但基于此我们认为教育资源的重新调整是没有合理理由的！至于是否有其他层面考量，从金地香蜜山在改变原有土地性质的基础上建房（非A类房产）仍保留学位，以及政府补贴性住房保留学位，作为香格丽苑的小区业主实在无法信服。所以有关部门将积分起点足够高的香格丽苑小区划出侨外的招生地段，需要监管部门介入推敲！！！3、 作为公民的基本权益完全没有保障香格丽苑业主是以高出市场均价很多的单价购买A类商品住房，我们小区业主群体历年来都是在侨外片区、甚至在全市范围都是贡献各项税收名列前茅的群体！！！侨外片区这么多年来我们就是教育附加税累计交得最多的一群人！！！家庭都是上下两代甚至三代举家，穷尽一生资产为孩子购置学区房，目标就是上侨外。在支付了高额的房价，高额的税费，背负巨大的债务负担的情况下为孩子上名校做保障。但是政府在没有合理理由下作出如此重大调整，罔顾我们作为居民和公民的合理利益保障，巨大的损失和心理负担谁来补偿？？？税收之下才有的教育资源，请取之于谁、用之于谁！！！作为侨外片区交税最高的群体，不容肆意剥夺我们自侨外建校我们就具备、多年来一直拥有的侨外教育资源！！！4、 招生地段调整罔顾目前孩子的实际权益所谓的“红岭教育集团红岭实验小学”仍在建设阶段，师资如何？校舍如何？现在全是字面意义上的吹嘘，一个现在都什么还不是的学校，毫无任何实际的说服力，就仓促发布调整方案，这样的“被调整”“被过渡”是否真实的考虑到孩子的基本权益保障。本身香格丽苑小区无论是地理位置还是原先的学区设置，无疑侨外的学区都是更加合理的，目前很多业主的小孩已经在侨外入学，如果这次的调整是缓解侨外的压力，那么请将原先不属于侨外学区的学生或者按照积分排名达不到的学生迁走，为何要将香格丽苑小区的学区划出。缓解任何一个学校的压力，都不应该建立在强制划走原招生地段居民学位的基础之上，保障社会公平正义，请先从保障孩子们的合理权益开始！！！5、 尊重历史沿革香格丽苑是2006年建成小区，侨外是9年前（2010年）建校，从侨外建校以来，香格丽苑一直归属侨外学区（甚至当时侨香村都未入伙），在目前外部环境没有改变的情况下，有什么理由改变历史沿革？6、 香格丽苑是具备A类商品房的产权性质香格丽苑小区是作为侨外小区为数不多的商品房A类住房，作为这样在福田区对于学位房积分政策的框架下，都是最高积分的一类小区，迁走我们是何原因。作为香格丽苑的业主我们是花真金白银的高房价购房，没有享受政府补贴的同时，没有购置违规住房的同时，我们还在为政府，为社会缴纳巨额的税收。而本身附着在房产上的学位权益却由他人说剥夺就剥夺，这个是否合理？ 7、 学位调整给业主实际生活将造成巨大困难在政府鼓励生二胎的大环境下，很多家庭都有两个孩子或者准备二胎，请问未来一个孩子在侨外一个孩子在别处上学，这种实际的困难如何解决？8、 招生地段调整程序不合规学位调整涉及成百上千个孩子未来，涉及成千上万个家庭幸福，这次未经征集民意、未经听证、未经合法程序就向全社会公开的“权威发布”，实质上就是形式上的公式告知，对于老百姓来说，这样的行政手段跟“强拆”何异？所涉及的调整地段有上万居民，上千适龄就学儿童，原属于他们的学位权益被莫名其妙、师出无名的强制剥夺，公权到底是为民众服务、以人民为中心，还是仍在肆意凌驾、罔顾民意？这个调整公告背后未有任何民意征集、听证公开，且无任何行政法规的支持，如何就能到了公示公告环节，如何就能即将变成一纸公文？？？新时代的特区，行政手段何时变得这样简单粗暴？？？剥夺此地居民和儿童们的原有权益，只用通知一声？？？政府部门的公信力何在？？？香格丽苑小区，作为多年来给特区贡献数十亿、百亿税收的居民，强烈要求相关领导关注，还我们应有享受公平优质教育资源的权益！还社会的公平公正！香格丽苑小区业主之一";
        byte[] bytes = value.getBytes();
        System.out.println("bytes.length:" + bytes.length);

        byte[] bytes1 = Arrays.copyOfRange(bytes, 0, 4000);
        System.out.println("bytes1.length:" + bytes1.length);

    }
}